RT-Thread/rt-thread/bsp/n32/n32gxx_lxx/libraries/N32G43x_Firmware_Library/n32g43x_std_periph_driver/src/n32g43x_gpio.c
        }
     position++;
    }
}


/**
 * @brief  Deinitializes the Alternate Functions (remap, event control
 *   and EXTI configuration) registers to their default reset values.
 */
void GPIO_AFIOInitDefault(void)
{
    RCC_EnableAPB2PeriphReset(RCC_APB2_PERIPH_AFIO, ENABLE);
    RCC_EnableAPB2PeriphReset(RCC_APB2_PERIPH_AFIO, DISABLE);
}

/**
 * @brief  Initializes the GPIOx peripheral according to the specified
 *         parameters in the GPIO_InitStruct.
 * @param GPIOx where x can be (A..D) to select the GPIO peripheral.
 * @param GPIO_InitStruct pointer to a GPIO_InitType structure that
 *         contains the configuration information for the specified GPIO peripheral.
 */

void GPIO_InitPeripheral(GPIO_Module* GPIOx, GPIO_InitType * GPIO_InitStruct)
{
    uint32_t pinpos = 0x00U;
    uint32_t tmp = 0x00U,tmpregister=0x00U;
    uint32_t position = 0x00U;
    uint32_t iocurrent = 0x00U;

    /* Check the parameters */
    assert_param(IS_GPIO_ALL_PERIPH(GPIOx));
    assert_param(IS_GPIO_MODE(GPIO_InitStruct->GPIO_Mode));
    assert_param(IS_GPIO_PIN(GPIO_InitStruct->Pin));
    assert_param(IS_GPIO_PULL(GPIO_InitStruct->GPIO_Pull));
    assert_param(IS_GPIO_SLEW_RATE(GPIO_InitStruct->GPIO_Slew_Rate));

    /*---------------------------- GPIO Mode Configuration -----------------------*/

    /*---------------------------- GPIO PL_CFG Configuration ------------------------*/

    while (((GPIO_InitStruct->Pin)>>position) != 0)
    {
        iocurrent = (GPIO_InitStruct->Pin)&(1U<<position);
        if (iocurrent)
        {
            pinpos = position * 2U;

            if ((GPIO_InitStruct->GPIO_Mode == GPIO_Mode_AF_PP) || (GPIO_InitStruct->GPIO_Mode == GPIO_Mode_AF_OD) || (GPIO_InitStruct->GPIO_Mode == GPIO_Mode_Input) || (GPIO_InitStruct->GPIO_Mode == GPIO_Mode_Analog))
            {
                /* Check if the Alternate function is compliant with the GPIO in use */
                assert_param(IS_GPIO_AF(GPIO_InitStruct->GPIO_Alternate));
                /* Configure Alternate function mapped with the current IO */
                if (position & 0x08)
                {
                    tmp = GPIOx->AFH;
                    tmp &= ~((uint32_t)0xF << ((uint32_t)(position & (uint32_t)0x07) * 4U));
                    tmp |= ((uint32_t)(GPIO_InitStruct->GPIO_Alternate) << ((uint32_t)(position & (uint32_t)0x07) * 4U)) ;
                    GPIOx->AFH = tmp;
                }
                else
                {
                    tmp = GPIOx->AFL;
                    tmp &= ~((uint32_t)0xF << ((uint32_t)(position & (uint32_t)0x07) * 4U)) ;
                    tmp |= ((uint32_t)(GPIO_InitStruct->GPIO_Alternate) << ((uint32_t)(position & (uint32_t)0x07) * 4U)) ;
                    GPIOx->AFL = tmp;
                }
            }
            /* Configure IO Direction mode (Input, Output, Alternate or Analog) */
            tmpregister = GPIOx->PMODE;
            tmp = ((uint32_t)GPIO_InitStruct->GPIO_Mode) & ((uint32_t)0x0F);
            tmpregister &= ~(((uint32_t)0x03) << pinpos);
            tmpregister |=( tmp << pinpos);
            GPIOx->PMODE = tmpregister;

            /* Configure pull-down mode */
            tmpregister = GPIOx->PUPD;
            tmp = (GPIO_InitStruct->GPIO_Pull & (uint32_t)0x03);
            tmpregister &=~(((uint32_t)0x03) << pinpos);
            tmpregister |= (tmp <<pinpos);
            GPIOx->PUPD = tmpregister;


            /* Configure driver current*/
            if ((GPIO_InitStruct->GPIO_Mode & GPIO_MODE) && (GPIO_InitStruct->GPIO_Mode != GPIO_Mode_Analog))
            {
                assert_param(IS_GPIO_CURRENT(GPIO_InitStruct->GPIO_Current));
                tmpregister = GPIOx->DS;
                tmp = (GPIO_InitStruct->GPIO_Current &((uint32_t)0x03));
                tmpregister &= ~(((uint32_t)0x03) << pinpos);
                tmpregister |= (tmp<<pinpos);
                GPIOx->DS = tmpregister;
            }
            /* Configure slew rate*/
                tmp = GPIOx->SR;
                tmp &=((uint32_t)(~((uint16_t)0x01 << position)));
                tmp |= (GPIO_InitStruct->GPIO_Slew_Rate &((uint32_t)0x01))<<position;
                GPIOx->SR = tmp;
            /*Configure Set/Reset register*/
            if (GPIO_InitStruct->GPIO_Pull == GPIO_Pull_Down)
            {
                GPIOx->PBC |= (((uint32_t)0x01) << position);
            }
            else
            {
                /* Set the corresponding POD bit */
                if (GPIO_InitStruct->GPIO_Pull == GPIO_Pull_Up)
                {
                    GPIOx->PBSC |= (((uint32_t)0x01) << position);
                }
            }

            /* In case of Output or Alternate function mode selection */
            if ((GPIO_InitStruct->GPIO_Mode == GPIO_Mode_Out_PP) || (GPIO_InitStruct->GPIO_Mode == GPIO_Mode_AF_PP) ||
             (GPIO_InitStruct->GPIO_Mode == GPIO_Mode_Out_OD) || (GPIO_InitStruct->GPIO_Mode == GPIO_Mode_AF_OD))
            {
                /* Configure the IO Output Type */

                tmp= GPIOx->POTYPE;
                tmp &= ~(((uint32_t)0x01U) << position) ;
                tmp |= (((GPIO_InitStruct->GPIO_Mode & GPIO_OUTPUT_TYPE) >> 4U) << position);
                GPIOx->POTYPE = tmp;
            }
            /*--------------------- EXTI Mode Configuration ------------------------*/
            /* Configure the External Interrupt or event for the current IO */
            if (GPIO_InitStruct->GPIO_Mode & EXTI_MODE)
            {
                /* Clear EXTI line configuration */
                tmp = EXTI->IMASK;
                tmp &= ~((uint32_t)0x01<<position);
                if ((GPIO_InitStruct->GPIO_Mode & GPIO_MODE_IT)== GPIO_MODE_IT)
                {
                    tmp |= ((uint32_t)0x01 << position);
                }
                EXTI->IMASK = tmp;

                tmp = EXTI->EMASK;
                tmp &= ~((uint32_t)0x01<<position);
                if ((GPIO_InitStruct->GPIO_Mode & GPIO_MODE_EVT)== GPIO_MODE_EVT)
                {
                    tmp |= ((uint32_t)0x01 << position);
                }
                EXTI->EMASK = tmp;

                /* Clear Rising Falling edge configuration */

